---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.GradientInterpolationType.Solid
enum: Autodesk.Revit.DB.Visual.GradientInterpolationType
source: html/ce9e1d57-a7cb-137d-ed6c-4250b4167399.htm
---
# Autodesk.Revit.DB.Visual.GradientInterpolationType.Solid